# brew
# https://github.com/nodenv/nodenv#installation
brew "nodenv"
brew "pyenv"
brew "rbenv"
brew "ruby-build"

# Cask apps
# Terminal
cask "iterm2"
brew "git"
# cask "warp"

# Browsers
cask "google-chrome"
cask "microsoft-edge"
cask "finicky"

# Communication
cask "slack"
cask "whatsapp"
cask "telegram"
cask "discord"

# Productivity
cask "raycast"
# cask "alfred"
cask "betterzip"
cask "rectangle"

# https://github.com/MonitorControl/MonitorControl
# Dell Monitor Controler
cask "monitorcontrol"

# Extras
# cask "rocket"
# cask "linearmouse"
cask "syntax-highlight", args: { no_quarantine: true } # syntax highlight code in notes

# Utilities
cask "spotify"
cask "vlc"
cask "soundsource"
cask "cleanshot"
cask "time-out"
cask "cleanmymac"
cask "keycue"
cask "onedrive"

cask "bartender"
cask "aldente" # helps with battery
cask "adguard"

# media key control
# https://stuntsoftware.com/reflex/
cask "reflex"
# cask "beardie"

# Development
cask "visual-studio-code"
cask "docker"
cask "sourcetree"

# Firewall
# https://objective-see.org/products/lulu.html
# cask "lulu"

# mas
mas "Irvue", id: 1039633667
mas "In Your Face", id: 1476964367
